; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips :typing)
  (:types block)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

    (:action dead-end-stack
  	     :parameters (?x - block ?y - block)
  	     :precondition (and (holding ?x) (clear ?y))
  	     :effect
  	     (and (not (holding ?x))
  		   (not (clear ?y))
  		   (clear ?x)
  		   ;; REMOVED: (handempty)
  		   (on ?x ?y)
  		 ))

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem BLOCKS-15-0)
(:domain BLOCKS)
(:objects DUMMY1 DUMMY2 A C L D J H K O N G I F B M E - block)
(:INIT (CLEAR E) (CLEAR M) (CLEAR B) (CLEAR F) (CLEAR I) (ONTABLE G)
 (ONTABLE N) (ONTABLE O) (ONTABLE K) (ONTABLE H) (ON E J) (ON J D) (ON D L)
 (ON L C) (ON C G) (ON M N) (ON B A) (ON A O) (ON F K) (ON I H) (HANDEMPTY))
(:goal (AND (ON G O) (ON O H) (ON H K) (ON K M) (ON M F) (ON F E) (ON E A)
            (ON A B) (ON B L) (ON L J) (ON J D) (ON D N) (ON N I) (ON I C)))
)

; plan
1. (unstack m n)
   deleted: (clear m) (handempty) (on m n)
   added: (holding m) (clear n)
   goals met: 1 of 14
2. (stack m f)
   deleted: (holding m) (clear f)
   added: (clear m) (handempty) (on m f)
   goals met: 2 of 14
3. (pick-up n)
   deleted: (ontable n) (clear n) (handempty)
   added: (holding n)
   goals met: 2 of 14
4. (stack n i)
   deleted: (holding n) (clear i)
   added: (clear n) (handempty) (on n i)
   goals met: 3 of 14
5. (unstack b a)
   deleted: (clear b) (handempty) (on b a)
   added: (holding b) (clear a)
   goals met: 3 of 14
6. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 3 of 14
7. (unstack a o)
   deleted: (clear a) (handempty) (on a o)
   added: (holding a) (clear o)
   goals met: 3 of 14
8. (stack a b)
   deleted: (holding a) (clear b)
   added: (clear a) (handempty) (on a b)
   goals met: 4 of 14
9. (unstack e j)
   deleted: (clear e) (handempty) (on e j)
   added: (holding e) (clear j)
   goals met: 4 of 14
10. (stack e a)
   deleted: (holding e) (clear a)
   added: (clear e) (handempty) (on e a)
   goals met: 5 of 14
11. (unstack j d)
   deleted: (clear j) (handempty) (on j d)
   added: (holding j) (clear d)
   goals met: 4 of 14
12. (stack j e)
   deleted: (holding j) (clear e)
   added: (clear j) (handempty) (on j e)
   goals met: 4 of 14
13. (unstack d l)
   deleted: (clear d) (handempty) (on d l)
   added: (holding d) (clear l)
   goals met: 4 of 14
14. (stack d n)
   deleted: (holding d) (clear n)
   added: (clear d) (handempty) (on d n)
   goals met: 5 of 14
15. (unstack l c)
   deleted: (clear l) (handempty) (on l c)
   added: (holding l) (clear c)
   goals met: 5 of 14
16. (stack l j)
   deleted: (holding l) (clear j)
   added: (clear l) (handempty) (on l j)
   goals met: 6 of 14
17. (unstack c g)
   deleted: (clear c) (handempty) (on c g)
   added: (holding c) (clear g)
   goals met: 6 of 14
18. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 6 of 14
19. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 6 of 14
20. (stack g o)
   deleted: (holding g) (clear o)
   added: (clear g) (handempty) (on g o)
   goals met: 7 of 14
21. (unstack d n)
   deleted: (clear d) (handempty) (on d n)
   added: (holding d) (clear n)
   goals met: 6 of 14
22. (stack d g)
   deleted: (holding d) (clear g)
   added: (clear d) (handempty) (on d g)
   goals met: 6 of 14
23. (unstack n i)
   deleted: (clear n) (handempty) (on n i)
   added: (holding n) (clear i)
   goals met: 5 of 14
24. (stack n d)
   deleted: (holding n) (clear d)
   added: (clear n) (handempty) (on n d)
   goals met: 5 of 14
25. (unstack i h)
   deleted: (clear i) (handempty) (on i h)
   added: (holding i) (clear h)
   goals met: 5 of 14
26. (stack i c)
   deleted: (holding i) (clear c)
   added: (clear i) (handempty) (on i c)
   goals met: 6 of 14
27. (unstack n d)
   deleted: (clear n) (handempty) (on n d)
   added: (holding n) (clear d)
   goals met: 6 of 14
28. (stack n i)
   deleted: (holding n) (clear i)
   added: (clear n) (handempty) (on n i)
   goals met: 7 of 14
29. (unstack d g)
   deleted: (clear d) (handempty) (on d g)
   added: (holding d) (clear g)
   goals met: 7 of 14
30. (stack d n)
   deleted: (holding d) (clear n)
   added: (clear d) (handempty) (on d n)
   goals met: 8 of 14
31. (unstack g o)
   deleted: (clear g) (handempty) (on g o)
   added: (holding g) (clear o)
   goals met: 7 of 14
32. (stack g d)
   deleted: (holding g) (clear d)
   added: (clear g) (handempty) (on g d)
   goals met: 7 of 14
33. (pick-up o)
   deleted: (ontable o) (clear o) (handempty)
   added: (holding o)
   goals met: 7 of 14
34. (stack o h)
   deleted: (holding o) (clear h)
   added: (clear o) (handempty) (on o h)
   goals met: 8 of 14
35. (unstack g d)
   deleted: (clear g) (handempty) (on g d)
   added: (holding g) (clear d)
   goals met: 8 of 14
36. (stack g o)
   deleted: (holding g) (clear o)
   added: (clear g) (handempty) (on g o)
   goals met: 9 of 14
37. (unstack l j)
   deleted: (clear l) (handempty) (on l j)
   added: (holding l) (clear j)
   goals met: 8 of 14
38. (stack l g)
   deleted: (holding l) (clear g)
   added: (clear l) (handempty) (on l g)
   goals met: 8 of 14
39. (unstack j e)
   deleted: (clear j) (handempty) (on j e)
   added: (holding j) (clear e)
   goals met: 8 of 14
40. (stack j d)
   deleted: (holding j) (clear d)
   added: (clear j) (handempty) (on j d)
   goals met: 9 of 14
41. (unstack l g)
   deleted: (clear l) (handempty) (on l g)
   added: (holding l) (clear g)
   goals met: 9 of 14
42. (stack l j)
   deleted: (holding l) (clear j)
   added: (clear l) (handempty) (on l j)
   goals met: 10 of 14
43. (unstack m f)
   deleted: (clear m) (handempty) (on m f)
   added: (holding m) (clear f)
   goals met: 9 of 14
44. (stack m g)
   deleted: (holding m) (clear g)
   added: (clear m) (handempty) (on m g)
   goals met: 9 of 14
45. (unstack f k)
   deleted: (clear f) (handempty) (on f k)
   added: (holding f) (clear k)
   goals met: 9 of 14
46. (stack f e)
   deleted: (holding f) (clear e)
   added: (clear f) (handempty) (on f e)
   goals met: 10 of 14
47. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 10 of 14
48. (stack k m)
   deleted: (holding k) (clear m)
   added: (clear k) (handempty) (on k m)
   goals met: 11 of 14
49. (unstack f e)
   deleted: (clear f) (handempty) (on f e)
   added: (holding f) (clear e)
   goals met: 10 of 14
50. (put-down f)
   deleted: (holding f)
   added: (clear f) (handempty) (ontable f)
   goals met: 10 of 14
51. (unstack e a)
   deleted: (clear e) (handempty) (on e a)
   added: (holding e) (clear a)
   goals met: 9 of 14
52. (stack e f)
   deleted: (holding e) (clear f)
   added: (clear e) (handempty) (on e f)
   goals met: 9 of 14
53. (unstack a b)
   deleted: (clear a) (handempty) (on a b)
   added: (holding a) (clear b)
   goals met: 8 of 14
54. (stack a k)
   deleted: (holding a) (clear k)
   added: (clear a) (handempty) (on a k)
   goals met: 8 of 14
55. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 8 of 14
56. (stack b l)
   deleted: (holding b) (clear l)
   added: (clear b) (handempty) (on b l)
   goals met: 9 of 14
57. (unstack a k)
   deleted: (clear a) (handempty) (on a k)
   added: (holding a) (clear k)
   goals met: 9 of 14
58. (stack a b)
   deleted: (holding a) (clear b)
   added: (clear a) (handempty) (on a b)
   goals met: 10 of 14
59. (unstack e f)
   deleted: (clear e) (handempty) (on e f)
   added: (holding e) (clear f)
   goals met: 10 of 14
60. (stack e a)
   deleted: (holding e) (clear a)
   added: (clear e) (handempty) (on e a)
   goals met: 11 of 14
61. (pick-up f)
   deleted: (ontable f) (clear f) (handempty)
   added: (holding f)
   goals met: 11 of 14
62. (stack f e)
   deleted: (holding f) (clear e)
   added: (clear f) (handempty) (on f e)
   goals met: 12 of 14
63. (unstack k m)
   deleted: (clear k) (handempty) (on k m)
   added: (holding k) (clear m)
   goals met: 11 of 14
64. (put-down k)
   deleted: (holding k)
   added: (clear k) (handempty) (ontable k)
   goals met: 11 of 14
65. (unstack m g)
   deleted: (clear m) (handempty) (on m g)
   added: (holding m) (clear g)
   goals met: 11 of 14
66. (stack m f)
   deleted: (holding m) (clear f)
   added: (clear m) (handempty) (on m f)
   goals met: 12 of 14
67. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 12 of 14
68. (stack k m)
   deleted: (holding k) (clear m)
   added: (clear k) (handempty) (on k m)
   goals met: 13 of 14
69. (unstack g o)
   deleted: (clear g) (handempty) (on g o)
   added: (holding g) (clear o)
   goals met: 12 of 14
70. (stack g k)
   deleted: (holding g) (clear k)
   added: (clear g) (handempty) (on g k)
   goals met: 12 of 14
71. (unstack o h)
   deleted: (clear o) (handempty) (on o h)
   added: (holding o) (clear h)
   goals met: 11 of 14
72. (put-down o)
   deleted: (holding o)
   added: (clear o) (handempty) (ontable o)
   goals met: 11 of 14
73. (unstack g k)
   deleted: (clear g) (handempty) (on g k)
   added: (holding g) (clear k)
   goals met: 11 of 14
74. (stack g o)
   deleted: (holding g) (clear o)
   added: (clear g) (handempty) (on g o)
   goals met: 12 of 14
75. (pick-up h)
   deleted: (ontable h) (clear h) (handempty)
   added: (holding h)
   goals met: 12 of 14
76. (stack h k)
   deleted: (holding h) (clear k)
   added: (clear h) (handempty) (on h k)
   goals met: 13 of 14
77. (unstack g o)
   deleted: (clear g) (handempty) (on g o)
   added: (holding g) (clear o)
   goals met: 12 of 14
78. (put-down g)
   deleted: (holding g)
   added: (clear g) (handempty) (ontable g)
   goals met: 12 of 14
79. (pick-up o)
   deleted: (ontable o) (clear o) (handempty)
   added: (holding o)
   goals met: 12 of 14
80. (stack o h)
   deleted: (holding o) (clear h)
   added: (clear o) (handempty) (on o h)
   goals met: 13 of 14
81. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 13 of 14
82. (dead-end-stack g o)
   deleted: (holding g) (clear o)
   added: (clear g) (on g o)
   goals met: 14 of 14
